In [3]:
import pandas as pd

## Series

데이터 타입임. 파이썬의 리스트랑 같음 >> 묶어서 한방에 다룬다라는 것.

In [4]:
#파이썬 리스트 형태
odd = [1,2,3,4,5] 
odd

[1, 2, 3, 4, 5]

In [5]:
#판다스 시리즈 형태
pd_odd = pd.Series(odd) 
pd_odd

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
#그러면 왜 판다스 시리즈가 왜 필요하냐? 바꿔줘야 판다스에서 제공하는 전용기능을 쓸 수 있음
odd.mean()

AttributeError: 'list' object has no attribute 'mean'

In [19]:
pd_odd.mean()

3.0

### DataFrame

In [20]:
# DF는 여러개의 시리즈로 이루어진 것
numbers = [
    [1,2,3],
    [4,5,6],
    [7,8,9]
]
numbers = pd.DataFrame(numbers)
numbers

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [23]:
type(numbers)

pandas.core.frame.DataFrame

In [24]:
numbers[0]

0    1
1    4
2    7
Name: 0, dtype: int64

In [26]:
type(numbers[0])

pandas.core.series.Series

In [27]:
type(numbers.loc[0])

pandas.core.series.Series

### 생성하기

In [51]:
transaction_url = "transaction (1).csv"
transaction = pd.read_csv(transaction_url, index_col = "Name")
transaction

            date  price      state
Name
Kang  2017-01-01    500  confirmed
Kim   2017-01-03    700  confirmed
Choi  2017-01-03    900  confirmed
Park  2017-01-05    800  confirmed
Lee   2017-01-07    500   canceled
Yoon  2017-01-09    700  confirmed
Jang  2017-01-09    600   canceled
Ko    2017-01-10    200   canceled

In [52]:
transaction.index

Index(['Kang', 'Kim', 'Choi', 'Park', 'Lee', 'Yoon', 'Jang', 'Ko'], dtype='object', name='Name')

In [53]:
transaction.values

array([['2017-01-01', 500, 'confirmed'],
       ['2017-01-03', 700, 'confirmed'],
       ['2017-01-03', 900, 'confirmed'],
       ['2017-01-05', 800, 'confirmed'],
       ['2017-01-07', 500, 'canceled'],
       ['2017-01-09', 700, 'confirmed'],
       ['2017-01-09', 600, 'canceled'],
       ['2017-01-10', 200, 'canceled']], dtype=object)

In [54]:
transaction.columns = ["date","amount","result"]
transaction

            date  amount     result
Name
Kang  2017-01-01     500  confirmed
Kim   2017-01-03     700  confirmed
Choi  2017-01-03     900  confirmed
Park  2017-01-05     800  confirmed
Lee   2017-01-07     500   canceled
Yoon  2017-01-09     700  confirmed
Jang  2017-01-09     600   canceled
Ko    2017-01-10     200   canceled

In [56]:
transaction.head(5)

            date  amount     result
Name
Kang  2017-01-01     500  confirmed
Kim   2017-01-03     700  confirmed
Choi  2017-01-03     900  confirmed
Park  2017-01-05     800  confirmed
Lee   2017-01-07     500   canceled

### 기본연산

In [58]:
transaction["amount"].mean()

612.5

In [59]:
transaction["amount"].max()

900

In [60]:
transaction["amount"].min()

200

In [62]:
transaction["result"] # 종류가 2가지 만개 십만개 백만개면 종류가 몇 개인지 파악이 안됨

Name
Kang    confirmed
Kim     confirmed
Choi    confirmed
Park    confirmed
Lee      canceled
Yoon    confirmed
Jang     canceled
Ko       canceled
Name: result, dtype: object

In [63]:
transaction["result"].unique() #중복제거하고 종류를 파악할 수 있음

array(['confirmed', 'canceled'], dtype=object)

In [65]:
transaction["result"].value_counts()

confirmed    5
canceled     3
Name: result, dtype: int64

In [70]:
transaction["result"].replace("canceled", "cancelled")
transaction
#이렇게 하면 안바뀌고

            date  amount     result
Name
Kang  2017-01-01     500  confirmed
Kim   2017-01-03     700  confirmed
Choi  2017-01-03     900  confirmed
Park  2017-01-05     800  confirmed
Lee   2017-01-07     500   canceled
Yoon  2017-01-09     700  confirmed
Jang  2017-01-09     600   canceled
Ko    2017-01-10     200   canceled

In [71]:
transaction["result"] = transaction["result"].replace("canceled", "cancelled")
transaction
#이렇게 해야 데이터가 바뀜 명시적으로 이렇게 선언해주어야함

            date  amount     result
Name
Kang  2017-01-01     500  confirmed
Kim   2017-01-03     700  confirmed
Choi  2017-01-03     900  confirmed
Park  2017-01-05     800  confirmed
Lee   2017-01-07     500  cancelled
Yoon  2017-01-09     700  confirmed
Jang  2017-01-09     600  cancelled
Ko    2017-01-10     200  cancelled

In [79]:
transaction["date"] = pd.to_datetime(transaction["date"])
transaction["date"].dt.year #month/day

Name
Kang    2017
Kim     2017
Choi    2017
Park    2017
Lee     2017
Yoon    2017
Jang    2017
Ko      2017
Name: date, dtype: int64

## 행렬 검색

In [81]:
transaction["date"] #컬럼 하나 가져오는 것

Name
Kang   2017-01-01
Kim    2017-01-03
Choi   2017-01-03
Park   2017-01-05
Lee    2017-01-07
Yoon   2017-01-09
Jang   2017-01-09
Ko     2017-01-10
Name: date, dtype: datetime64[ns]

In [83]:
type(transaction)

pandas.core.frame.DataFrame

In [85]:
#컬럼을 하나 접근하면 시리즈 여러개 접근하면 데이터 프레임
type(transaction[["date","amount"]])

pandas.core.frame.DataFrame

In [86]:
transaction[["date","amount"]] #여러기 가져올 때 대괄호 2개 왜냐면 파이썬과 호환되게 하려고

           date  amount
Name
Kang 2017-01-01     500
Kim  2017-01-03     700
Choi 2017-01-03     900
Park 2017-01-05     800
Lee  2017-01-07     500
Yoon 2017-01-09     700
Jang 2017-01-09     600
Ko   2017-01-10     200

In [87]:
["date","amount"] # 파이썬의 리스트

['date', 'amount']

In [88]:
columns = ["date","amount"]

In [89]:
transaction[columns]

           date  amount
Name
Kang 2017-01-01     500
Kim  2017-01-03     700
Choi 2017-01-03     900
Park 2017-01-05     800
Lee  2017-01-07     500
Yoon 2017-01-09     700
Jang 2017-01-09     600
Ko   2017-01-10     200

## row 검색

In [90]:
# 캉이란 사람 결제정보, 하나가져오면 시리즈, 여러개 가져오면 데이터 프레임
transaction.loc["Kang"]

date      2017-01-01 00:00:00
amount                    500
result              confirmed
Name: Kang, dtype: object

In [91]:
transaction.loc[["Kang","Kim","Choi"]]

           date  amount     result
Name
Kang 2017-01-01     500  confirmed
Kim  2017-01-03     700  confirmed
Choi 2017-01-03     900  confirmed

In [92]:
type(transaction.loc[["Kang","Kim","Choi"]])

pandas.core.frame.DataFrame

In [93]:
type(transaction.loc["Kang"])

pandas.core.series.Series

In [94]:
name = ["Kang", "Kim", "Choi"]
transaction.loc[name]

           date  amount     result
Name
Kang 2017-01-01     500  confirmed
Kim  2017-01-03     700  confirmed
Choi 2017-01-03     900  confirmed

## 행렬을 동시에

In [101]:
# 1 번째 방식 권장하지 않음 대괄호 열었다 닫았다에 따라 실행이 되는거라..
%timeit transaction.loc["Kang"]["date"]

152 µs ± 3.11 µs per loop (mean ± std. dev. of 7 runs, 10000 loops each)

In [98]:
# 권장은
%timeit transaction.loc["Kang","date"]

12.2 µs ± 273 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

In [100]:
%timeit transaction.at["Kang","date"] #빠르지만, 한개씩 밖에 접근 못함 그 이상 가져오라면 loc

9.36 µs ± 529 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

## 색인 (판다스의 꽃)

In [105]:
transaction[transaction["date"] == "2017-01-03"] # 색인 속도도 빠름

           date  amount     result
Name
Kim  2017-01-03     700  confirmed
Choi 2017-01-03     900  confirmed

In [106]:
transaction[transaction["amount"] < 600]

           date  amount     result
Name
Kang 2017-01-01     500  confirmed
Lee  2017-01-07     500  cancelled
Ko   2017-01-10     200  cancelled

In [107]:
transaction

           date  amount     result
Name
Kang 2017-01-01     500  confirmed
Kim  2017-01-03     700  confirmed
Choi 2017-01-03     900  confirmed
Park 2017-01-05     800  confirmed
Lee  2017-01-07     500  cancelled
Yoon 2017-01-09     700  confirmed
Jang 2017-01-09     600  cancelled
Ko   2017-01-10     200  cancelled

In [108]:
# isin 이 세가지 후보에 해당하면 True, False
date_candidate = ["2017-01-01","2017-01-03","2017-01-09"]
transaction[transaction["date"].isin(date_candidate)]

           date  amount     result
Name
Kang 2017-01-01     500  confirmed
Kim  2017-01-03     700  confirmed
Choi 2017-01-03     900  confirmed
Yoon 2017-01-09     700  confirmed
Jang 2017-01-09     600  cancelled

In [109]:
transaction

           date  amount     result
Name
Kang 2017-01-01     500  confirmed
Kim  2017-01-03     700  confirmed
Choi 2017-01-03     900  confirmed
Park 2017-01-05     800  confirmed
Lee  2017-01-07     500  cancelled
Yoon 2017-01-09     700  confirmed
Jang 2017-01-09     600  cancelled
Ko   2017-01-10     200  cancelled

In [110]:
# 2개이상 조건일 때 VIP 고객 찾을 때 깔끔하게!! >> 변수로 빼서 연산하자!!

confirmed =transaction["result"] =="confirmed"
high = transaction["amount"] >=500

# &(and, shift + 7)
transaction[confirmed & high]

           date  amount     result
Name
Kang 2017-01-01     500  confirmed
Kim  2017-01-03     700  confirmed
Choi 2017-01-03     900  confirmed
Park 2017-01-05     800  confirmed
Yoon 2017-01-09     700  confirmed

In [111]:
# or조건
transaction[confirmed | high]

           date  amount     result
Name
Kang 2017-01-01     500  confirmed
Kim  2017-01-03     700  confirmed
Choi 2017-01-03     900  confirmed
Park 2017-01-05     800  confirmed
Lee  2017-01-07     500  cancelled
Yoon 2017-01-09     700  confirmed
Jang 2017-01-09     600  cancelled

## 컬럼 추가 & 수정

In [113]:
# 추가, 수정 문법 똑같음 
transaction["card-holder"] = "KB CARD"
transaction

           date  amount     result card-holder
Name
Kang 2017-01-01     500  confirmed     KB CARD
Kim  2017-01-03     700  confirmed     KB CARD
Choi 2017-01-03     900  confirmed     KB CARD
Park 2017-01-05     800  confirmed     KB CARD
Lee  2017-01-07     500  cancelled     KB CARD
Yoon 2017-01-09     700  confirmed     KB CARD
Jang 2017-01-09     600  cancelled     KB CARD
Ko   2017-01-10     200  cancelled     KB CARD

In [116]:
# 개수만 정확하게 맞으면 들어감 결제순서를 알고싶다고 해서 데이터 넣는다고 하면?
transaction["order"] = [1,2,3,4,5,6,7,8]
transaction

           date  amount     result card-holder  order
Name
Kang 2017-01-01     500  confirmed     KB CARD      1
Kim  2017-01-03     700  confirmed     KB CARD      2
Choi 2017-01-03     900  confirmed     KB CARD      3
Park 2017-01-05     800  confirmed     KB CARD      4
Lee  2017-01-07     500  cancelled     KB CARD      5
Yoon 2017-01-09     700  confirmed     KB CARD      6
Jang 2017-01-09     600  cancelled     KB CARD      7
Ko   2017-01-10     200  cancelled     KB CARD      8

In [119]:
#심화 >> 컬럼은 조건마다 이렇게 추가하고 저렇게 추가하라 
over500 = transaction["amount"] >= 500
confirmed = transaction["result"] == "confirmed"


transaction["VIP"] = transaction["amount"] >= 500
transaction

           date  amount     result card-holder  order    VIP
Name
Kang 2017-01-01     500  confirmed     KB CARD      1   True
Kim  2017-01-03     700  confirmed     KB CARD      2   True
Choi 2017-01-03     900  confirmed     KB CARD      3   True
Park 2017-01-05     800  confirmed     KB CARD      4   True
Lee  2017-01-07     500  cancelled     KB CARD      5   True
Yoon 2017-01-09     700  confirmed     KB CARD      6   True
Jang 2017-01-09     600  cancelled     KB CARD      7   True
Ko   2017-01-10     200  cancelled     KB CARD      8  False

In [120]:
transaction.loc[transaction["amount"]>=500, "Status"] = "VIP"
transaction.loc[transaction["amount"]<500, "Status"] = "None"
transaction

           date  amount     result card-holder  order    VIP Status
Name
Kang 2017-01-01     500  confirmed     KB CARD      1   True    VIP
Kim  2017-01-03     700  confirmed     KB CARD      2   True    VIP
Choi 2017-01-03     900  confirmed     KB CARD      3   True    VIP
Park 2017-01-05     800  confirmed     KB CARD      4   True    VIP
Lee  2017-01-07     500  cancelled     KB CARD      5   True    VIP
Yoon 2017-01-09     700  confirmed     KB CARD      6   True    VIP
Jang 2017-01-09     600  cancelled     KB CARD      7   True    VIP
Ko   2017-01-10     200  cancelled     KB CARD      8  False   None

## apply 기능

In [126]:
# 언제 쓰냐? 같은 기능을 판다스로 안되면 파이썬으로
def is_vip(amount):
    if amount <= 500:
        return " VIP"
    else:
        return "None"
    
transaction["Status"] = transaction["amount"].apply(is_vip)
transaction

           date  amount     result card-holder  order    VIP Status
Name
Kang 2017-01-01     500  confirmed     KB CARD      1   True    VIP
Kim  2017-01-03     700  confirmed     KB CARD      2   True   None
Choi 2017-01-03     900  confirmed     KB CARD      3   True   None
Park 2017-01-05     800  confirmed     KB CARD      4   True   None
Lee  2017-01-07     500  cancelled     KB CARD      5   True    VIP
Yoon 2017-01-09     700  confirmed     KB CARD      6   True   None
Jang 2017-01-09     600  cancelled     KB CARD      7   True   None
Ko   2017-01-10     200  cancelled     KB CARD      8  False    VIP

In [130]:
def translate_result(result):
    if result == "confirmed":
        return "승인"
    else:
        return "취소"

transaction["result(ko)"] = transaction["result"].apply(translate_result)
transaction

           date  amount     result card-holder  order    VIP Status result(ko)
Name
Kang 2017-01-01     500  confirmed     KB CARD      1   True    VIP         승인
Kim  2017-01-03     700  confirmed     KB CARD      2   True   None         승인
Choi 2017-01-03     900  confirmed     KB CARD      3   True   None         승인
Park 2017-01-05     800  confirmed     KB CARD      4   True   None         승인
Lee  2017-01-07     500  cancelled     KB CARD      5   True    VIP         취소
Yoon 2017-01-09     700  confirmed     KB CARD      6   True   None         승인
Jang 2017-01-09     600  cancelled     KB CARD      7   True   None         취소
Ko   2017-01-10     200  cancelled     KB CARD      8  False    VIP         취소

## nan 처리

In [42]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'movie': ['thg', 'thg', 'mol', 'mol', 'lob', 'lob'],
                  'rating': [3., 4., 5., np.nan, np.nan, np.nan],
                  'name': ['John', np.nan, 'andy', 'Graham', np.nan, np.nan]})

In [43]:
df

  movie  rating    name
0   thg     3.0    John
1   thg     4.0     NaN
2   mol     5.0    andy
3   mol     NaN  Graham
4   lob     NaN     NaN
5   lob     NaN     NaN

In [44]:
filtered = df['name'].dropna()

In [45]:
filtered

0      John
2      andy
3    Graham
Name: name, dtype: object